[
  {
    "category": "Command Line Options",
    "command-line-only": true,
    "brief": "Options that can only be provided via the command line",
    "details": "The following options can be used to control the general behavior of MrDocs and can only be provided via the command line. These include options to specify inputs and the configuration file, which cannot be set on the configuration file itself.",
    "options": [
      {
        "name": "cmd-line-inputs",
        "command-line-only": true,
        "brief": "Configuration or compilation database files",
        "details": "The inputs are configuration files or compilation database files that used to generate the documentation. When the input ends with `mrdocs.yml`, it is interpreted as a configuration file, the file is read and the options are used to generate the documentation as if it was provided to the `config` option. When the input ends with `compilation_database.json` or `CMakeLists.txt`, it is interpreted as a compilation database file, the file is read and the compiler flags are used to generate the documentation as if it was provided to the `compilation-database` option.",
        "type": "list<path>",
        "default": [],
        "command-line-sink": true,
        "filename-mapping": {
          "mrdocs.yml": "config",
          "compile_commands.json": "compilation-database",
          "CMakeLists.txt": "compilation-database"
        },
        "relative-to": "<cwd>",
        "must-exist": true,
        "should-exist": true
      },
      {
        "name": "config",
        "command-line-only": true,
        "brief": "MrDocs configuration file",
        "details": "The configuration file is a YAML file that contains the options used to generate the documentation. The configuration file is read and the options are used to generate the documentation. The configuration file can be used to specify the source code, the output directory, the compilation database, the generator, and the filters.",
        "type": "file-path",
        "default": "<cwd>/mrdocs.yml",
        "relative-to": "<cwd>",
        "required": true,
        "must-exist": true
      }
    ]
  },
  {
    "category": "Paths",
    "brief": "Paths to the source code and output directories",
    "options": [
      {
        "name": "source-root",
        "brief": "Path to the root directory of the source code",
        "details": "Path to the root directory of the source code. This path is used as a default for input files and a base for relative paths formed from absolute paths. This should typically be the root directory of the git project, as relative paths formed from it can be used to create links to these source files in the repository. Templates use the `base-url` option to create links to the source code.",
        "type": "dir-path",
        "default": "<config-dir>",
        "relative-to": "<config-dir>",
        "must-exist": true
      },
      {
        "name": "output",
        "brief": "Directory or file for generating output",
        "details": "Multipage generators expect a directory. Single page generators expect a file or a directory where the file will be created. If the directory does not exist, it will be created.",
        "type": "path",
        "default": "<config-dir>/reference-output",
        "relative-to": "<config-dir>",
        "must-exist": false,
        "should-exist": false
      },
      {
        "name": "compilation-database",
        "brief": "Path to the compilation database",
        "details": "Path to the compilation database or a build script to generate it. The compilation database is a JSON file that contains the compiler commands used to build the source code. The compilation database is used to extract the compiler flags and the source files used to build the source code and extract symbols. This option also accepts the path to a build script such as CMakeLists.txt to be used to generate the compilation database. In this case, MrDocs will look for CMake in `PATH` or in `CMAKE_ROOT` and run the script to generate the compilation database file.",
        "type": "file-path",
        "default": "",
        "relative-to": "<config-dir>",
        "must-exist": true
      }
    ]
  },
  {
    "category": "Filters",
    "brief": "Filters to include or exclude files and symbols from the documentation",
    "options": [
      {
        "name": "input",
        "brief": "Input directories to extract symbols from",
        "details": "Input directories to extract. Only symbols defined in files in these directories are extracted. The paths are relative to the mrdocs configuration file.",
        "type": "list<path>",
        "must-exist": false,
        "should-exist": true,
        "relative-to": "<config-dir>",
        "default": [
          "<source-root>/."
        ]
      },
      {
        "name": "recursive",
        "brief": "Recursively include files from \"input\" paths",
        "details": "Recursively include files. When set to true, MrDocs includes files in subdirectories of the input directories. When set to false, MrDocs includes only the files in the input directories.",
        "type": "bool",
        "default": true
      },
      {
        "name": "file-patterns",
        "brief": "File patterns to include",
        "details": "File patterns to include. Only the files that match these patterns are extracted. The patterns are relative to the input directories.",
        "type": "list<path-glob>",
        "default": [
          "*.hpp",
          "*.h",
          "*.hh",
          "*.ipp",
          "*.inc",
          "*.cpp",
          "*.cc",
          "*.cxx",
          "*.c",
          "*.hxx"
        ]
      },
      {
        "name": "exclude",
        "brief": "Input directories to exclude",
        "details": "Symbols defined in files in these directories are not extracted even if they are in the list of include directories. When relative, the paths are relative to the directory of the mrdocs configuration file. For instance, \"include/experimental\" will exclude all files in the directory `<config-dir>/include/experimental`.",
        "type": "list<path>",
        "must-exist": false,
        "should-exist": true,
        "relative-to": "<config-dir>",
        "default": []
      },
      {
        "name": "exclude-patterns",
        "brief": "File patterns to exclude",
        "details": "File patterns to exclude. Files that match these patterns are not extracted even if they are in the list of include directories. The patterns are relative to the configuration file. A single * will match all files in the directory. Double ** will match all files in the directory and its subdirectories.",
        "type": "list<path-glob>",
        "relative-to": "<config-dir>",
        "default": []
      },
      {
        "name": "include-symbols",
        "brief": "Symbol patterns to include",
        "details": "If any patterns are defined here, only symbols that match one of these patterns are extracted. The patterns are applied to the fully qualified name of the symbol without any leading \"::\". A single \"*\" will match all symbols in the namespace. Double \"**\" will match all symbols in the namespace and its subnamespaces. The patterns also support \"?\" for any chars, \"[<chars>]\" for charsets, \"[^<chars>]\" for inverted charsets, and \"{<glob>,...}\" for alternatives.",
        "type": "list<symbol-glob>",
        "relative-to": "<config-dir>",
        "default": []
      },
      {
        "name": "exclude-symbols",
        "brief": "Symbol patterns to exclude",
        "details": "A symbol that matches one of these patterns is not extracted even if whitelisted by \"include-symbols\". See the documentation for \"include-symbols\" for the pattern syntax.",
        "type": "list<symbol-glob>",
        "default": []
      },
      {
        "name": "see-below",
        "brief": "Exposition only symbols rendered as \"see-below\".",
        "details": "Symbols that match one of these filters are tagged as \"see-below\" in the documentation, and so do symbols in scopes tagged as \"see-below\". This option is used to remove details about symbols that are considered part of the private API of the project but the user might need to interact with. In the documentation page for this symbol, the symbol is exposition only: the synopsis of the implementation is rendered as \"see-below\" and members of scopes (such as a namespace or record) are not listed. The rest of the documentation is rendered as usual to explain the symbol. See the documentation for \"include-symbol\" for the pattern syntax.",
        "type": "list<symbol-glob>",
        "default": []
      },
      {
        "name": "implementation-defined",
        "brief": "Symbols rendered as \"implementation-defined\"",
        "details": "Symbols that match one of these filters are tagged as \"implementation-defined\" in the documentation, and so do symbols in scopes tagged as \"implementation-defined\". This option is used to exclude symbols from the documentation that are considered part of the private API of the project. An \"implementation-defined\" symbol has no documentation page in the output. If any other symbol refers to it, the reference is rendered as \"implementation-defined\". See the documentation for \"include-symbol\" for the pattern syntax.",
        "type": "list<symbol-glob>",
        "default": []
      }
    ]
  },
  {
    "category": "Comment Parsing",
    "brief": "Options to control how comments are parsed",
    "details": "MrDocs extracts metadata from the comments in the source code. The following options control how comments are parsed.",
    "options": [
      {
        "name": "auto-brief",
        "brief": "Use the first line of the comment as the brief",
        "details": "When set to `true`, MrDocs uses the first line (until the first dot, question mark, or exclamation mark) of the comment as the brief of the symbol. When set to `false`, a explicit @brief command is required.",
        "type": "bool",
        "default": true
      }
    ]
  },
  {
    "category": "Metadata Extraction",
    "brief": "Metadata and C++ semantic constructs to extract",
    "details": "MrDocs extracts metadata and C++ semantic constructs from the source code to create the documentation. Semantic constructs are patterns not directly represented in the source code AST but can be inferred from the corpus, such as SFINAE. The following options control the extraction of metadata and C++ semantic constructs.",
    "options": [
      {
        "name": "extract-all",
        "brief": "Extract all symbols",
        "details": "When set to `true`, MrDocs extracts all symbols from the source code, even if no documentation is provided. MrDocs can only identify whether a symbol is ultimated documented after extracting information from all translation units. For this reason, when this option is set to `false`, it's still recommendable to provide file and symbol filters so that only the desired symbols are traversed and stored by MrDocs.",
        "type": "bool",
        "default": true
      },
      {
        "name": "extract-private",
        "brief": "Extraction policy for private class members",
        "details": "Determine whether private class members should be extracted",
        "type": "bool",
        "default": false
      },
      {
        "name": "extract-private-virtual",
        "brief": "Extraction policy for private virtual methods of a class",
        "details": "Determine whether private virtual methods of a class should be extracted",
        "type": "bool",
        "default": false
      },
      {
        "name": "extract-private-bases",
        "brief": "Extraction policy for private base classes",
        "details": "Determine whether private base classes should be extracted",
        "type": "bool",
        "default": false
      },
      {
        "name": "extract-static",
        "brief": "Extraction policy for static members of a file",
        "details": "Determine whether static members of a file should be extracted. This option does not refer to static members of a class.",
        "type": "bool",
        "default": false
      },
      {
        "name": "extract-local-classes",
        "brief": "Extraction policy for records defined locally in source files",
        "details": "Determine whether records only defined locally in source files should be extracted.",
        "type": "bool",
        "default": true
      },
      {
        "name": "extract-anonymous-namespaces",
        "brief": "Extraction policy for anonymous namespaces",
        "details": "Determine whether symbols in anonymous namespaces should be extracted. When set to `always`, symbols in anonymous namespaces are always extracted. When set to `dependency`, symbols in anonymous namespaces are extracted only if they are referenced by the source code. When set to `never`, symbols in anonymous namespaces are never extracted.",
        "type": "bool",
        "default": true
      },
      {
        "name": "inherit-base-members",
        "brief": "Determine how derived classes inherit base members",
        "details": "Determine how derived classes inherit members of base classes. When set to `never`, derived classes do not inherit members of base classes and only the relationship is stored. When set to `reference`, derived classes list members of base classes but references are still linked to the base class. When set to `copy-dependencies`, a reference is created by default and a copy is created when the base class is a dependency. When set to `copy-all`, a copy is created for each base symbol as if it was declared in the derived class. If the base class is a dependency, the extraction mode is copied from the new parent.",
        "type": "enum",
        "values": [
          "never",
          "reference",
          "copy-dependencies",
          "copy-all"
        ],
        "default": "copy-dependencies"
      },
      {
        "name": "sort-members",
        "brief": "Sort the members of a record or namespace",
        "details": "When set to `true`, sort the members of a record or namespace by name and parameters. When set to `false`, the members are included in the declaration order they are extracted.",
        "type": "bool",
        "default": true
      },
      {
        "name": "sort-members-ctors-1st",
        "brief": "Sort constructors first",
        "details": "When set to `true`, constructors are sorted first in the list of members of a record.",
        "type": "bool",
        "default": true
      },
      {
        "name": "sort-members-dtors-1st",
        "brief": "Sort destructors first",
        "details": "When set to `true`, destructors are sorted first in the list of members of a record.",
        "type": "bool",
        "default": true
      },
      {
        "name": "sort-members-assignment-1st",
        "brief": "Sort assignment operators first",
        "details": "When set to `true`, assignment operators are sorted first in the list of members of a record.",
        "type": "bool",
        "default": true
      },
      {
        "name": "sort-members-conversion-last",
        "brief": "Sort conversion operators last",
        "details": "When set to `true`, conversion operators are sorted last in the list of members of a record or namespace.",
        "type": "bool",
        "default": true
      },
      {
        "name": "sort-members-relational-last",
        "brief": "Sort relational operators last",
        "details": "When set to `true`, relational operators are sorted last in the list of members of a record or namespace.",
        "type": "bool",
        "default": true
      }
    ]
  },
  {
    "category": "Semantic Constructs",
    "brief": "C++ semantic constructs to extract",
    "details": "Semantic constructs are patterns not directly represented in the source code AST but can be inferred from the corpus, such as SFINAE.",
    "options": [
      {
        "name": "sfinae",
        "brief": "Detect and reduce SFINAE expressions",
        "details": "When set to true, MrDocs detects SFINAE expressions in the source code and extracts them as part of the documentation. Expressions such as `std::enable_if<...>` are detected, removed, and documented as a requirement. MrDocs uses an algorithm that extracts SFINAE infomation from types by identifying inspecting the primary template and specializations to detect the result type and the controlling expressions in a specialization.",
        "type": "bool",
        "default": true
      },
      {
        "name": "overloads",
        "brief": "Detect and group function overloads",
        "details": "When set to `true`, MrDocs detects function overloads and groups them as a single symbol type. The documentation for this new symbol comes from the union of non-ambiguous metadata from the functions.",
        "type": "bool",
        "default": true
      }
    ]
  },
  {
    "category": "Generators",
    "brief": "Generators to create the documentation and their options",
    "options": [
      {
        "name": "generator",
        "brief": "Generator used to create the documentation",
        "details": "The generator is responsible for creating the documentation from the extracted symbols. The generator uses the extracted symbols and the templates to create the documentation. The generator can create different types of documentation such as HTML, XML, and AsciiDoc.",
        "type": "enum",
        "values": [
          "adoc",
          "html",
          "xml"
        ],
        "default": "adoc"
      },
      {
        "name": "multipage",
        "brief": "Generate a multipage documentation",
        "details": "Generates a multipage documentation. The output directory must be a directory. This option acts as a hint to the generator to create a multipage documentation. Whether the hint is followed or not depends on the generator.",
        "type": "bool",
        "default": true
      },
      {
        "name": "base-url",
        "brief": "Base URL for links to source code",
        "details": "Base URL for links to source code. The base URL is used to create links to the source code in the documentation. The base URL is combined with the path to the source file to create the link.",
        "type": "string",
        "default": ""
      },
      {
        "name": "addons",
        "brief": "Path to the Addons directory",
        "details": "Path to the Addons directory. The Addons directory contains the template files used by generators to create the documentation. When a custom Addons directory is not specified, the default templates are used. The default templates are located at the `share/mrdocs/addons` directory of the MrDocs installation. Users can create custom templates by copying the default templates to a custom directory and specifying the custom directory using this option.",
        "type": "path",
        "default": "<mrdocs-root>/share/mrdocs/addons",
        "relative-to": "<config-dir>",
        "must-exist": true
      },
      {
        "name": "tagfile",
        "brief": "Path for the tagfile",
        "details": "Specifies the full path (filename) where the generated tagfile should be saved. If left empty, no tagfile will be generated.",
        "type": "file-path",
        "default": "<output-dir>/reference.tag.xml",
        "relative-to": "<output-dir>",
        "must-exist": false,
        "should-exist": false
      },
      {
        "name": "legible-names",
        "brief": "Use legible names",
        "details": "Use legible names for ids in the documentation. When set to true, MrDocs uses legible names for symbols in the documentation. These are symbols that are legible but still safe for URLs. When the option is set to false, MrDocs uses a hash of the symbol ID.",
        "type": "bool",
        "default": true
      },
      {
        "name": "embedded",
        "brief": "Output an embeddable document",
        "details": "Output an embeddable document, which excludes the header, the footer, and everything outside the body of the document. This option is useful for producing documents that can be inserted into an external template.",
        "type": "bool",
        "default": false
      },
      {
        "name": "show-namespaces",
        "brief": "Show namespace pages in the documentation",
        "details": "When set to true, MrDocs creates a page for each namespace in the documentation.",
        "type": "bool",
        "default": true
      }
    ]
  },
  {
    "category": "Build options",
    "brief": "Options for building the source code",
    "details": "When MrDocs is responsible to running the build scripts and generating the compilation database, these options are used to build the source code.",
    "options": [
      {
        "name": "cmake",
        "brief": "CMake arguments when generating the compilation database from CMakeLists.txt",
        "details": "When the compilation-database option is a CMakeLists.txt file, these arguments are passed to the cmake command to generate the compilation_database.json.",
        "type": "string",
        "default": ""
      },
      {
        "name": "defines",
        "brief": "Additional defines passed to the compiler",
        "details": "Additional defines passed to the compiler when building the source code. These defines are added to the compilation database regardless of the strategy to generate it.",
        "type": "list<string>",
        "default": []
      },
      {
        "name": "use-system-stdlib",
        "brief": "Use the system C++ standard library",
        "details": "To achieve reproducible results, MrDocs bundles the LibC++ headers. To use the C++ standard library available in the system instead, set this option to true.",
        "type": "bool",
        "default": false
      },
      {
        "name": "stdlib-includes",
        "brief": "C++ Standard Library include paths",
        "details": "When `use-system-stdlib` is disabled, the C++ standard library headers are available in these paths.",
        "type": "list<path>",
        "default": [
          "<mrdocs-root>/share/mrdocs/headers/libcxx",
          "<mrdocs-root>/share/mrdocs/headers/clang"
        ],
        "relative-to": "<config-dir>",
        "must-exist": false,
        "should-exist": true
      },
      {
        "name": "use-system-libc",
        "brief": "Use the system C standard library",
        "details": "To achieve reproducible results, MrDocs bundles the LibC headers with its definitions. To use the C standard library available in the system instead, set this option to true.",
        "type": "bool",
        "default": false
      },
      {
        "name": "libc-includes",
        "brief": "Standard Library include paths",
        "details": "When `use-system-libc` is disabled, the C standard library headers are available in these paths.",
        "type": "list<path>",
        "default": [
          "<mrdocs-root>/share/mrdocs/headers/libc-stubs"
        ],
        "relative-to": "<config-dir>",
        "must-exist": false,
        "should-exist": true
      },
      {
        "name": "system-includes",
        "brief": "System include paths",
        "details": "System include paths. These paths are used to add directories to the system include search path. The system include search path is used to search for system headers. The system headers are headers that are provided by the system and are not part of the project. The system headers are used to provide the standard library headers and other system headers. The system headers are not part of the project and are not checked for warnings and errors.",
        "type": "list<path>",
        "relative-to": "<config-dir>",
        "default": [],
        "must-exist": false,
        "should-exist": true
      },
      {
        "name": "includes",
        "brief": "Include paths",
        "details": "Include paths. These paths are used to add directories to the include search path. The include search path is used to search for headers. The headers are used to provide declarations and definitions of symbols. The headers are part of the project and are checked for warnings and errors.",
        "type": "list<path>",
        "default": [],
        "relative-to": "<config-dir>",
        "must-exist": false,
        "should-exist": true
      }
    ]
  },
  {
    "category": "Warnings",
    "brief": "Warnings and progress messages",
    "options": [
      {
        "name": "verbose",
        "brief": "Verbose output",
        "details": "Verbose output. When set to true, MrDocs outputs additional information during the generation of the documentation.",
        "type": "bool",
        "default": false
      },
      {
        "name": "report",
        "brief": "The minimum reporting level",
        "details": "The reporting level determines the amount of information displayed during the generation of the documentation. The value `-1` delegates the decision to the `log-level` option.",
        "type": "unsigned",
        "default": -1,
        "min-value": -1,
        "max-value": 5,
        "deprecated": "Use `log-level` instead"
      },
      {
        "name": "log-level",
        "brief": "The minimum reporting level",
        "details": "The reporting level determines the amount of information displayed during the generation of the documentation.",
        "type": "enum",
        "values": [
          "trace",
          "debug",
          "info",
          "warn",
          "error",
          "fatal"
        ],
        "default": "info"
      },
      {
        "name": "warnings",
        "brief": "Enable warning messages",
        "details": "When set to `true`, MrDocs outputs warning messages during the generation of the documentation. It is usually recommended to enable warnings while writing the documentation.",
        "type": "bool",
        "default": true
      },
      {
        "name": "warn-if-undocumented",
        "brief": "Warn if symbols are not documented",
        "details": "When set to `true`, MrDocs outputs a warning message if a symbol that passes all filters is not documented.",
        "type": "bool",
        "default": true
      },
      {
        "name": "warn-if-doc-error",
        "brief": "Warn if documentation has errors",
        "details": "When set to `true`, MrDocs outputs a warning message if the documentation of a symbol has errors such as duplicate parameters and parameters that don't exist.",
        "type": "bool",
        "default": true
      },
      {
        "name": "warn-no-paramdoc",
        "brief": "Warn if parameters are not documented",
        "details": "When set to `true`, MrDocs outputs a warning message if a named function parameter is not documented.",
        "type": "bool",
        "default": true
      },
      {
        "name": "warn-unnamed-param",
        "brief": "Warn if documented functions have unnamed parameters",
        "details": "When set to `true`, MrDocs outputs a warning message if a documented function has a parameter that is not named.",
        "type": "bool",
        "default": false
      },
      {
        "name": "warn-if-undoc-enum-val",
        "brief": "Warn if enum values are not documented",
        "details": "When set to `true`, MrDocs outputs a warning message if an enum value is not documented.",
        "type": "bool",
        "default": true
      },
      {
        "name": "warn-broken-ref",
        "brief": "Warn if a documentation reference is broken",
        "details": "When set to `true`, MrDocs outputs a warning message if a reference in the documentation is broken.",
        "type": "bool",
        "default": true
      },
      {
        "name": "warn-as-error",
        "brief": "Treat warnings as errors",
        "details": "When set to `true`, MrDocs treats warnings as errors and stops the generation of the documentation.",
        "type": "bool",
        "default": false
      }
    ]
  },
  {
    "category": "Miscellaneous",
    "brief": "Miscellaneous options",
    "options": [
      {
        "name": "concurrency",
        "command-line-only": true,
        "brief": "Number of threads to use",
        "details": "The desired level of concurrency: 0 for hardware-suggested.",
        "type": "unsigned",
        "default": 0,
        "min-value": 0
      },
      {
        "name": "ignore-map-errors",
        "brief": "Continue if files are not mapped correctly",
        "details": "When set to true, MrDocs continues to generate the documentation even if some files are not mapped correctly. Files are not mapped correctly when the source file is not found or the compilation database does not contain the compiler flags for the source file.",
        "type": "bool",
        "default": false
      },
      {
        "name": "ignore-failures",
        "brief": "Whether AST visitation failures should not stop the program",
        "details": "When set to true, MrDocs continues to generate the documentation even if there are AST visitation failures. AST visitation failures occur when the source code contains constructs that are not supported by MrDocs.",
        "type": "bool",
        "default": false
      }
    ]
  }
]